import random #если модуля на компе нет, нужно установить
print("┏━━━┳━━━┳━━━┳━━━┓") 
print("┃┏━┓┃┏━┓┃┏━┓┃┏━┓┃")
print("┃┗━┛┃┃╋┃┃┗━━┫┗━━┓")
print("┃┏━━┫┗━┛┣━━┓┣━━┓┃")
print("┃┃╋╋┃┏━┓┃┗━┛┃┗━┛┃")
print("┗┛╋╋┗┛╋┗┻━━━┻━━━┛")
print("┏━━━┳━━━┳━┓╋┏┳━━━┳━━━┳━━━┳━━━━┳━━━┓")
print("┃┏━┓┃┏━━┫┃┗┓┃┃┏━━┫┏━┓┃┏━┓┃┏┓┏┓┃┏━━┛")
print("┃┃╋┗┫┗━━┫┏┓┗┛┃┗━━┫┗━┛┃┃╋┃┣┛┃┃┗┫┗━━┓")
print("┃┃┏━┫┏━━┫┃┗┓┃┃┏━━┫┏┓┏┫┗━┛┃╋┃┃╋┃┏━━┛")
print("┃┗┻━┃┗━━┫┃╋┃┃┃┗━━┫┃┃┗┫┏━┓┃╋┃┃╋┃┗━━┓")
print("┗━━━┻━━━┻┛╋┗━┻━━━┻┛┗━┻┛╋┗┛╋┗┛╋┗━━━┛")
print("         🄱 🅈   🅁 🅄 🅂 🄻 🄰 🄽 🄲 🄷 🅁")
symbol='1234567890qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM' #массив с которого берем символы
lenth=int(input("Введите длину пароля:")) 
password="" #сам пароль
for n in range(lenth): #цикл который работает пока не достигнет заданной длины пароля
	password+=random.choice(symbol) #берем рандомное символ и добавляем к паролю
print('Ваш пароль:\n',password,'\nУдачи!')